In [ ]:
import pandas as pd
import numpy as np

np.random.seed(100)
vendite = pd.DataFrame(np.random.randint(5, 50, size=(7, 3)), columns=["torte", "biscotti", "taralli"], index=["lu", "mar", "mer", "gio", "ven", "sat", "dom"])
vendite

     torte  biscotti  taralli
lu      13        29        8
mar     44        28       20
mer     15        35       39
gio      7        39       19
ven     39        29       20
sat     41        48       21
dom     14        34       27

In [14]:
vendite["torte"]

lu     13
mar    44
mer    15
gio     7
ven    39
sat    41
dom    14
Name: torte, dtype: int32

In [17]:
vendite.loc["gio"]

torte        7
biscotti    39
taralli     19
Name: gio, dtype: int32

In [21]:
vendite.loc["mer":"dom", "biscotti":"taralli"]

     biscotti  taralli
mer        35       39
gio        39       19
ven        29       20
sat        48       21
dom        34       27

In [23]:
vendite.sum(axis=0)

torte       173
biscotti    242
taralli     154
dtype: int64

In [25]:
vendite['torte'].idxmax()

'mar'

In [45]:
vendite["totvendday"] = 0
vendite

     torte  biscotti  taralli  totvendday
lu      13        29        8           0
mar     44        28       20           0
mer     15        35       39           0
gio      7        39       19           0
ven     39        29       20           0
sat     41        48       21           0
dom     14        34       27           0

In [46]:
vendite["totvendday"] = vendite.sum(axis=1)
vendite

     torte  biscotti  taralli  totvendday
lu      13        29        8          50
mar     44        28       20          92
mer     15        35       39          89
gio      7        39       19          65
ven     39        29       20          88
sat     41        48       21         110
dom     14        34       27          75

In [47]:
(vendite["totvendday"] >  80 ).sum()

np.int64(4)